In [2]:
import numpy as np 
import pandas as pd

In [5]:
a=np.array([
    [1,5,7,6],
    [4,8,3,7]


])

In [6]:
a

array([[1, 5, 7, 6],
       [4, 8, 3, 7]])

In [7]:
g7=pd.Series([25,36.5,45,7,98,78,42,15,16,3,2,45])

In [9]:
g7

0     25.0
1     36.5
2     45.0
3      7.0
4     98.0
5     78.0
6     42.0
7     15.0
8     16.0
9      3.0
10     2.0
11    45.0
dtype: float64

In [10]:
g7.name='Poppulation name'

In [11]:
g7

0     25.0
1     36.5
2     45.0
3      7.0
4     98.0
5     78.0
6     42.0
7     15.0
8     16.0
9      3.0
10     2.0
11    45.0
Name: Poppulation name, dtype: float64

In [12]:
g7.index=['Canada', 'Negiria', 'Tunisia', 'Croitia', 'England', 'America', 'France', 'Argentine', 'Italia', 'Morocco','Mali','Brazil']

In [13]:
g7

Canada       25.0
Negiria      36.5
Tunisia      45.0
Croitia       7.0
England      98.0
America      78.0
France       42.0
Argentine    15.0
Italia       16.0
Morocco       3.0
Mali          2.0
Brazil       45.0
Name: Poppulation name, dtype: float64

In [14]:
g7['Mali']

2.0

In [17]:
g7.iloc[0]

25.0

In [18]:
g8=pd.Series({
    'Germany': 24.52,
    'Holland': 80.65,
    'Kuait': 45.36,
    'Soudan': 484.36,
    'Saudia': 451.1  
})

In [22]:
g8.name='population'

In [24]:
g8

Germany     24.52
Holland     80.65
Kuait       45.36
Soudan     484.36
Saudia     451.10
Name: population, dtype: float64

In [25]:
g8*100

Germany     2452.0
Holland     8065.0
Kuait       4536.0
Soudan     48436.0
Saudia     45110.0
Name: population, dtype: float64

In [26]:
g8['Holland']=35

In [27]:
g8

Germany     24.52
Holland     35.00
Kuait       45.36
Soudan     484.36
Saudia     451.10
Name: population, dtype: float64

In [30]:
Workers=pd.DataFrame({
    
    'Name':['Ali', 'Houssem', 'Bacem', 'Ridha'],
    'Age':[20, 32, 16, 23],
    'Wealth':['Medium', 'rich', 'poor', 'rich']  
    
}, columns=['Name', 'Age', 'Wealth'])

In [33]:
Workers

      Name  Age  Wealth
0      Ali   20  Medium
1  Houssem   32    rich
2    Bacem   16    poor
3    Ridha   23    rich

In [34]:
Workers.index=['W1','W2','W3','W4']

In [35]:
Workers

       Name  Age  Wealth
W1      Ali   20  Medium
W2  Houssem   32    rich
W3    Bacem   16    poor
W4    Ridha   23    rich

In [37]:
Workers.columns

Index(['Name', 'Age', 'Wealth'], dtype='object')

In [38]:
Workers.index

Index(['W1', 'W2', 'W3', 'W4'], dtype='object')

In [39]:
Workers.shape

(4, 3)

In [40]:
Workers.size

12

In [45]:
Workers.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, W1 to W4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   Wealth  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 128.0+ bytes

In [44]:
Workers.describe()

             Age
count   4.000000
mean   22.750000
std     6.800735
min    16.000000
25%    19.000000
50%    21.500000
75%    25.250000
max    32.000000

In [48]:
Workers.dtypes.value_counts()

object    2
int64     1
dtype: int64

In [51]:
Workers.loc['W1']

Name         Ali
Age           20
Wealth    Medium
Name: W1, dtype: object

In [52]:
Workers.iloc[-1]

Name      Ridha
Age          23
Wealth     rich
Name: W4, dtype: object

In [53]:
Workers['Name']

W1        Ali
W2    Houssem
W3      Bacem
W4      Ridha
Name: Name, dtype: object

In [54]:
Workers['Name'].to_frame()

       Name
W1      Ali
W2  Houssem
W3    Bacem
W4    Ridha

In [55]:
Workers[['Name','Age']]

       Name  Age
W1      Ali   20
W2  Houssem   32
W3    Bacem   16
W4    Ridha   23

In [58]:
Workers.loc['W1':'W3']

       Name  Age  Wealth
W1      Ali   20  Medium
W2  Houssem   32    rich
W3    Bacem   16    poor

In [60]:
Workers.loc['W1':'W3','Wealth']

W1    Medium
W2      rich
W3      poor
Name: Wealth, dtype: object

In [61]:
Workers['Age']>20

W1    False
W2     True
W3    False
W4     True
Name: Age, dtype: bool

In [65]:
Workers.loc[Workers['Age']>20]

       Name  Age Wealth
W2  Houssem   32   rich
W4    Ridha   23   rich

In [66]:
Workers.loc[Workers['Age']>20, 'Name']

W2    Houssem
W4      Ridha
Name: Name, dtype: object

In [70]:
Workers.drop('W1')

       Name  Age Wealth
W2  Houssem   32   rich
W3    Bacem   16   poor
W4    Ridha   23   rich

In [71]:
Workers.drop(columns=['Wealth'])

       Name  Age
W1      Ali   20
W2  Houssem   32
W3    Bacem   16
W4    Ridha   23